from datetime import datetime, date, time

today = datetime.now()

print(today.strftime("Сегодня %d %B %Y года"))

my_date = "02.03.2020"

d, m, y, = my_date.split(".")

print(d, m, y)

days = {
        "01": "первое",
        "02": "второе",
        "03": "третье",
        "04": "четвертое",
        "05": "пятое",
        "06": "шестое",
        "07": "седьмое",
        "08": "восьмое",
        "09": "девятое",
        "10": "десятое",
        "11": "одинадцатое",
        "12": "двенадцатое",
        "13": "тринадцатое",
        "14": "четырнадцатое",
        "15": "пятнадцатое",
        "16": "шестнадцатое",
        "17": "семнадцатое",
        "18": "восемнадцатое",
        "19": "девятнадцатое",
        "20": "двадцатое",
        "21": "двадцать пераое",
        "22": "двадцать второе",
        "23": "двадцать третье",
        "24": "двадцать сетвертое",
        "25": "двадцать пятое",
        "26": "двадцать шестое",
        "27": "двадцать седьмое",
        "28": "двадцать восьмое",
        "29": "двадцать девятое",
        "30": "тридцатое",
        "31": "тридцать пераое",
        }

maths = {
        "01": "январь",
        "02": "февраль",
        "03": "март",
        "04": "апрель",
        "05": "май",
        "06": "июнь",
        "07": "июль",
        "08": "август",
        "09": "сентябрь",
        "10": "октябрь",
        "11": "ноябрь",
        "12": "декабрь",
        }
result = f'{days[d]} {maths[m]} {y} года'
print(result)
